#ifndef __TIM_H
#define __TIM_H

/*====================	 定时器资源分配   ====================
	TIM1(高级)	················PWM1~PWM4
	TIM2		················定时器
	TIM3		················
	TIM4		················蜂鸣器发声
	TIM5		················混色LED三色控制
	TIM6(基本)	················PID闭环
	TIM7(基本)	················遥控器连接检测
	TIM8(高级)	················PWM5~PWM7
	TIM9		················
	TIM10		················IMU恒温控制
	TIM11		················
	TIM12		················
	TIM13		················CAN总线设备连接检测
	TIM14		················
  =============================================================*/

void TIM_Init(void);//TIM2定时器初始化

#endif
